; domain
(define (domain hanoi)
(:requirements :strips)
(:predicates (clear ?x)
             (on ?x ?y)
             (smaller ?x ?y))

(:action move
:parameters (?disc ?from ?to)
:precondition (and (smaller ?to ?disc) 
                   (on ?disc ?from) 
                   (clear ?disc) 
                   (clear ?to))
:effect  (and (clear ?from) 
              (on ?disc ?to) 
              (not (on ?disc ?from))  
              (not (clear ?to)))
 ))

; problem
(define (problem hanoi-3)
(:domain hanoi)
(:objects peg1 peg2 peg3 d1 d2 d3 )
(:init
(smaller peg1 d1)
(smaller peg1 d2)
(smaller peg1 d3)
(smaller peg2 d1)
(smaller peg2 d2)
(smaller peg2 d3)
(smaller peg3 d1)
(smaller peg3 d2)
(smaller peg3 d3)
(smaller d1 d1)
(smaller d2 d1)
(smaller d3 d1)
(smaller d2 d2)
(smaller d3 d2)
(clear peg2)
            (clear peg3)
            (clear d1)
(on d3 peg1)
(on d2 d3)
(on d1 d2)
)
(:goal
(and 
(on d3 peg3)
(on d2 d3)
(on d1 d2)
)
)
)

; plan
1. (move d1 d2 peg3)
   deleted: (on d1 d2) (clear peg3)
   added: (clear d2) (on d1 peg3)
   goals met: 1 of 3
2. (move d2 d3 peg2)
   deleted: (on d2 d3) (clear peg2)
   added: (clear d3) (on d2 peg2)
   goals met: 0 of 3
3. (move d1 peg3 d2)
   deleted: (on d1 peg3) (clear d2)
   added: (clear peg3) (on d1 d2)
   goals met: 1 of 3
4. (move d3 peg1 peg3)
   deleted: (on d3 peg1) (clear peg3)
   added: (clear peg1) (on d3 peg3)
   goals met: 2 of 3
5. (move d1 d2 peg1)
   deleted: (on d1 d2) (clear peg1)
   added: (clear d2) (on d1 peg1)
   goals met: 1 of 3
6. (move d2 peg2 d3)
   deleted: (on d2 peg2) (clear d3)
   added: (clear peg2) (on d2 d3)
   goals met: 2 of 3
7. (move d1 peg1 d2)
   deleted: (on d1 peg1) (clear d2)
   added: (clear peg1) (on d1 d2)
   goals met: 3 of 3
